import fs from 'fs'
import fetch from 'node-fetch'
import { xpRange } from '../lib/levelling.js'
const { levelling } = '../lib/levelling.js'
import { promises } from 'fs'
import { join } from 'path'
let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, command }) => {
try {        
/*let _package = JSON.parse(await promises.readFile(join(__dirname, '../package.json')).catch(_ => ({}))) || {}*/
let { exp, estrellas, level, role } = global.db.data.users[m.sender]
let { min, xp, max } = xpRange(level, global.multiplier)
let name = await conn.getName(m.sender)
let _uptime = process.uptime() * 1000
let _muptime
if (process.send) {
process.send('uptime')
_muptime = await new Promise(resolve => {
process.once('message', resolve)
setTimeout(resolve, 1000)
}) * 1000
}
let user = global.db.data.users[m.sender]
let muptime = clockString(_muptime)
let uptime = clockString(_uptime)
let totalreg = Object.keys(global.db.data.users).length
let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length
let who = m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
let mentionedJid = [who]
let perfil = await conn.profilePictureUrl(who, 'image').catch(_ => 'https://qu.ax/QGAVS.jpg')
let taguser = '@' + m.sender.split("@s.whatsapp.net")[0]
const vid = ['https://qu.ax/mDBOz.mp4', 'https://qu.ax/mDBOz.mp4', 'https://qu.ax/kjaSa.mp4']

let menu = `ׅ ︵፝֟⏜ᩨ︵  ⋱   ⁝  ׄ ⋰  ︵ᩨ⏜︵፝֟  ׅ  \n\n✿𝆬    *𝖧𝗈𝗅𝖺 𝖡𝗂𝖾𝗇𝗏𝖾𝗇𝗂𝖽@* ☕ ᪲\n☕ ᪲  *𝖠𝗅 𝗆𝖾𝗇𝗎 𝖽𝖾 Shadow*  ✿𝆬\nス  *𝖼𝗋𝖾𝖺𝖽𝗈 𝗉𝗈𝗋  ꒰  ꧁⟣٭𝕹𝕷𝕬٭⟢꧂ ꒱*  🍮
  
🍒⫘⫘⫘⫘⫘⫘❁︩︪•°ֺ໋۪݊🌸°໋•︪︩❁⫘⫘⫘⫘⫘⫘🍒        
   📥✩⢄⢁--ᑲᥡ ꧁⟣٭𝕹𝕷𝕬٭⟢꧂࠭--⡈⡠✩🔱 

*⚔️ ¡ʜᴏʟᴀ! \`${taguser}\` sᴏʏ ✦ sһᥲძ᥆ᥕ ✰, ${saludo}*


   ╭─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🧃⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╮
   🌹⬪࣪ꥈ𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ \`𝗠𝗘𝗡𝗨-𝗕𝗢𝗧\` ໑⃪࣭۪ٜ݊݊݊݊𑁍ꥈ࣪⬪🌹
   ╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🌛⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯
> •👤⬪࣪ꥈ໑ٜ࣪⚘۪۬ *ᴄʀᴇᴀᴅᴏʀ* » ꧁⟣٭NLA٭⟢꧂
> •🔱⬪࣪ꥈ໑ٜ࣪⚘۪۬ *ᴍᴏᴅᴏ* » privado vip
> •🍙⬪࣪ꥈ໑ٜ࣪⚘۪۬ *ʟɪʙʀᴇʀɪᴀ* » Baileys
> •🌵⬪࣪ꥈ໑ٜ࣪⚘۪۬ *ʙᴏᴛ* » ${(conn.user.jid == global.conn.user.jid ? '*𝗕𝗢𝗧 𝗢𝗙𝗖*' : '*𝗦𝗨𝗕𝗕𝗢𝗧*')}
> •🍜⬪࣪ꥈ໑ٜ࣪⚘۪۬ *ᴀᴄᴛɪᴠᴏ* » ${uptime}
> •💫⬪࣪ꥈ໑ٜ࣪⚘۪۬ *ᴜsᴜᴀʀɪᴏs ʀᴇɢɪsᴛʀᴀᴅᴏs*
> •🍩⬪࣪ꥈ໑ٜ࣪⚘۪۬» ${totalreg}

‎‎▬▭▬▭▬▭▬▭▬▭▬▭▬▭▬
‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎

‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎
   ╭࣭࣭࣭࣭࣭࣭ٜ۫┄̸࣭࣭࣭࣭࣭ٜ۫☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬⚔️⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸┄̸࣭࣭࣭࣭࣭ٜ۫┄࣭࣭࣭۫┄̸࣭࣭࣭࣭࣭ٜ۫┄࣭࣭࣭۫┄̸࣭۫┄̸࣭࣭࣭࣭࣭ٜ۫┄̸࣭۫┄̸࣭࣭࣭࣭࣭ٜ۫┄࣭࣭࣭۫╮
  💫⬪࣪ꥈ𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪  \`𝗨𝗦𝗨𝗔𝗥𝗜𝗢\` ໑⃪࣭۪ٜ݊݊݊݊𑁍ꥈ࣪⬪❄️
    ╰┄̸࣭࣭࣭࣭࣭ٜ۫┄࣭࣭࣭۫┄̸࣭۫┄̸࣭࣭࣭࣭࣭ٜ۫┄࣭࣭࣭۫┄̸࣭۫┄̸࣭࣭࣭࣭࣭ٜ۫┄̸࣭࣭࣭࣭࣭ٜ۫┄࣭࣭࣭۫☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🍧⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸┄̸࣭࣭࣭࣭࣭ٜ۫╯‎
> •⚔️⬪࣪ꥈ໑ٜ࣪⚘۪۬ *ᴄʟɪᴇɴᴛᴇ* » ${nombre}
> •🌎⬪࣪ꥈ໑ٜ࣪⚘۪۬ *ᴘᴀɪs* » ${global.userNationality}
> •✨⬪࣪ꥈ໑ٜ࣪⚘۪۬ *ᴇxᴘ* » ${exp}
> •⛃⬪࣪ꥈ໑ٜ࣪⚘۪۬ *${moneda}* » ${estrellas}
> •🍫⬪࣪ꥈ໑ٜ࣪⚘۪۬ *ɴɪᴠᴇʟ* » ${level}
> •🥤⬪࣪ꥈ໑ٜ࣪⚘۪۬ *ʀᴀɴɢᴏ* » ${role}

▬▭▬▭▬▭▬▭▬▭▬▭▬▭▬‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎
   *─ׄ─ׄ─⭒─ׄ─ׅ─ׄ⭒─ׄ─ׄ─⭒─ׄ─ׄ─⭒─ׄ─ׅ─*

    ⚙️_*𝐋𝐈𝐒𝐓 𝐃𝐄 𝐂𝐎𝐌𝐀𝐍𝐃𝐒*_⭐

𓂂𓏸  𐅹੭੭   *\`ɪɴғᴏ-ʙᴏᴛ\`* 🪻 ᦡᦡ
*┊🪻✎* .formarpareja5
*┊🪻✎* .estado
*┊🪻✎* .host
*┊🪻✎* .hosting
*┊🪻✎* .botreglas
*┊🪻✎* .hornymenu
*┊🪻✎* .menu
*┊🪻✎* .menu2
*┊🪻✎* .runtime
*┊🪻✎* .script
*┊🪻✎* .staff
*┊🪻✎* .menulista
*┊🪻✎* .menulogos/logos
*┊🪻✎* .blocklist
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ʙᴜsᴄᴀᴅᴏʀᴇs\`* ⚔️ ᦡᦡ
*┊⚔️✎* .githubsearch
*┊⚔️✎* .google <búsqueda>
*┊⚔️✎* .mercadolibre <búsqueda>
*┊⚔️✎* .imagen <query>
*┊⚔️✎* .pinterest
*┊⚔️✎* .tiktoksearch <txt>
*┊⚔️✎* .soundcloudsearch
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`sᴇʀʙᴏᴛ\`* 🍦 ᦡᦡ
*┊🍦✎* .jadibot
*┊🍦✎* .serbot
*┊🍦✎* .bots
*┊🍦✎* .deletebot
*┊🍦✎* .pausarai
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ᴊᴜᴇɢᴏs\`* 📥 ᦡᦡ
*┊📥✎* .69 @tag
*┊📥✎* .abrazar <@usuario>
*┊📥✎* .acertijo
*┊📥✎* .agarrar @tag
*┊📥✎* .anal @tag
*┊📥✎* .sonrojarse @tag
*┊📥✎* .gay <@tag> | <nombre>
*┊📥✎* .lesbiana <@tag> | <nombre>
*┊📥✎* .pajero <@tag> | <nombre>
*┊📥✎* .pajera <@tag> | <nombre>
*┊📥✎* .puto <@tag> | <nombre>
*┊📥✎* .puta <@tag> | <nombre>
*┊📥✎* .manco <@tag> | <nombre>
*┊📥✎* .manca <@tag> | <nombre>
*┊📥✎* .rata <@tag> | <nombre>
*┊📥✎* .prostituta <@tag> | <nombre>
*┊📥✎* .prostituto <@tag> | <nombre>
*┊📥✎* .apostar *<cantidad>*
*┊📥✎* .chupartetas @tag
*┊📥✎* .consejo
*┊📥✎* .cum @tag
*┊📥✎* .dance *<@user>*
*┊📥✎* .formarpareja5
*┊📥✎* .abrazar @tag
*┊📥✎* .violar @tag
*┊📥✎* .dormir @tag
*┊📥✎* .lamber @tag
*┊📥✎* .enamorada @tag
*┊📥✎* .mamada @tag
*┊📥✎* .meme
*┊📥✎* .violar @tag
*┊📥✎* .nombreninja *<texto>*
*┊📥✎* .acariciar @tag
*┊📥✎* .penetrar @user
*┊📥✎* .personalidad
*┊📥✎* .piropo
*┊📥✎* .pokedex *<pokemon>*
*┊📥✎* .pucheros @tag
*┊📥✎* .pregunta
*┊📥✎* .golpear @tag
*┊📥✎* .reto
*┊📥✎* .ruleta *<cantidad> <color>*
*┊📥✎* .rusa @tag
*┊📥✎* .triste @tag
*┊📥✎* .scared @tag
*┊📥✎* .sexo @tag
*┊📥✎* .ship
*┊📥✎* .love
*┊📥✎* .timida @tag
*┊📥✎* .simi
*┊📥✎* .bot
*┊📥✎* .dormir @tag
*┊📥✎* .dormir @tag
*┊📥✎* .top *<texto>*
*┊📥✎* .violar @tag
*┊📥✎* .tijeras @tag
*┊📥✎* .zodiac *2002 02 25*
*┊📥✎* .cancion
*┊📥✎* .math <mode>
*┊📥✎* .ppt
*┊📥✎* .slot <apuesta>
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ʀᴏʟʟᴡᴀɪғᴜ\`* 🧃 ᦡᦡ
*┊🧃✎* .character
*┊🧃✎* .confirmar
*┊🧃✎* .darrw @usuario <personaje>
*┊🧃✎* .guardar <personaje>
*┊🧃✎* .sacar <personaje>
*┊🧃✎* .obtenidos
*┊🧃✎* .robarpersonaje
*┊🧃✎* .roll
*┊🧃✎* .toprw
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ʀ-ᴘ-ɢ\`* 🌵 ᦡᦡ
*┊🌵✎* .bank
*┊🌵✎* .coins
*┊🌵✎* .crimen
*┊🌵✎* .daily
*┊🌵✎* .claim
*┊🌵✎* .depositar
*┊🌵✎* .lb
*┊🌵✎* .levelup
*┊🌵✎* .minar
*┊🌵✎* .retirar
*┊🌵✎* .rob2
*┊🌵✎* .rob
*┊🌵✎* .addprem [@user] <days>
*┊🌵✎* .slut
*┊🌵✎* .trabajar
*┊🌵✎* .codigo <coins>
*┊🌵✎* .canjear <codigo>
*┊🌵✎* .inventario 
*┊🌵✎* .transfer [tipo] [cantidad] [@tag]
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ʀᴇɢɪsᴛʀᴏ\`* 🎣 ᦡᦡ
*┊🎣✎* .profile
*┊🎣✎* .unreg
*┊🎣✎* .reg
*┊🎣✎* .set
*┊🎣✎* .setgenre <establece tu genero>
*┊🎣✎* .delgenre
*┊🎣✎* .setdesc
*┊🎣✎* .deldesc
*┊🎣✎* .setbirth <establece tu cumpleaños>
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ᴇ-x-ᴘ\`* 🪷 ᦡᦡ
*┊🪷✎* .bal
*┊🪷✎* .daily
*┊🪷✎* .Buy
*┊🪷✎* .Buyall
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`sᴛɪᴋᴇʀs\`* 🫐 ᦡᦡ
*┊🫐✎* .toimg (reply)
*┊🫐✎* .qc
*┊🫐✎* .stiker <img>
*┊🫐✎* .sticker <url>
*┊🫐✎* .wm <packname>|<author>
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ᴀɴɪᴍᴇs\`* 💎 ᦡᦡ
*┊💎✎* .sakurita
*┊💎✎* .karolg
*┊💎✎* .antiguo
*┊💎✎* .lolivid
*┊💎✎* .loli
*┊💎✎* .ppcouple
*┊💎✎* .neko
*┊💎✎* .waifu
*┊💎✎* .akira
*┊💎✎* .akiyama
*┊💎✎* .anna
*┊💎✎* .asuna
*┊💎✎* .ayuzawa
*┊💎✎* .boruto
*┊💎✎* .chiho
*┊💎✎* .chitoge
*┊💎✎* .deidara
*┊💎✎* .erza
*┊💎✎* .elaina
*┊💎✎* $.eba
*┊💎✎* .emilia
*┊💎✎* .hestia
*┊💎✎* .hinata
*┊💎✎* .inori
*┊💎✎* .isuzu
*┊💎✎* .itachi
*┊💎✎* .itori
*┊💎✎* .kaga
*┊💎✎* .kagura
*┊💎✎* .kaori
*┊💎✎* .keneki
*┊💎✎* kotori
*┊💎✎* .kurumi
*┊💎✎* .madara
*┊💎✎* .mikasa
*┊💎✎* .miku
*┊💎✎* .minato
*┊💎✎* .naruto
*┊💎✎* .nezuko
*┊💎✎* .sagiri
*┊💎✎* .sasuke
*┊💎✎* .sakura
*┊💎✎* .cosplay
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ᴅᴀᴛᴀʙᴀsᴇ\`* 🍁 ᦡᦡ
*┊🍁✎* .delvn <text>
*┊🍁✎* .delmsg <text>
*┊🍁✎* .delimg <text>
*┊🍁✎* .delsticker <text>
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ғɪxᴍᴇɴsᴀᴊᴇ\`* ✈️ ᦡᦡ
*┊✈️✎* .dsowner
*┊✈️✎* .ds
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ɢʀᴜᴘᴏs\`* ☕ ᦡᦡ
*┊☕✎* .group abrir / cerrar
*┊☕✎* .delete
*┊☕✎* .setppgroup
*┊☕✎* .rentar2
*┊☕✎* .setwelcome
*┊☕✎* .demote
*┊☕✎* .encuesta <text|text2>
*┊☕✎* .hidetag
*┊☕✎* .infogrupo
*┊☕✎* .invite *<numero>*
*┊☕✎* .kick
*┊☕✎* .link
*┊☕✎* .promote
*┊☕✎* .rentar
*┊✎* .tagall *<mesaje>*
*┊☕✎* .invocar *<mesaje>*
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ᴏɴ / ᴏғғ\`* ⚙️ ᦡᦡ
*┊⚙️✎* .enable <option>
*┊⚙️✎* .disable <option>
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ᴅᴇsᴄᴀʀɢᴀs\`* 📥 ᦡᦡ
*┊📥✎* .facebook
*┊📥✎* .fb
*┊📥✎* .play
*┊📥✎* .playvid
*┊📥✎* .gitclone *<url git>*
*┊📥✎* .instagram
*┊📥✎* .ig
*┊📥✎* .imagen <query>
*┊📥✎* .mediafire <url>
*┊📥✎* .sound
*┊📥✎* .apkmod
*┊📥✎* .ytmp3doc
*┊📥✎* .ytmp4doc
*┊📥✎* .spotify
*┊📥✎* .tiktok
*┊📥✎* .tw
*┊📥✎* .ytmp4 *<url youtube>*
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ʜᴇʀʀᴀᴍɪᴇɴᴛᴀs\`* 🛠️ ᦡᦡ
*┊🛠️✎* .toanime
*┊🛠️✎* .tts <lang> <teks>
*┊🛠️✎* .imagen <query>
*┊🛠️✎* .remini
*┊🛠️✎* .hd
*┊🛠️✎* .enhance
*┊🛠️✎* .nuevafotochannel
*┊🛠️✎* .nosilenciarcanal
*┊🛠️✎* .silenciarcanal
*┊🛠️✎* .noseguircanal
*┊🛠️✎* .seguircanal
*┊🛠️✎* .avisoschannel
*┊🛠️✎* .resiviravisos
*┊🛠️✎* .inspect
*┊🛠️✎* .inspeccionar
*┊🛠️✎* .eliminarfotochannel
*┊🛠️✎* .reactioneschannel
*┊🛠️✎* .reaccioneschannel
*┊🛠️✎* .nuevonombrecanal
*┊🛠️✎* .nuevadescchannel
*┊🛠️✎* .readvo
*┊🛠️✎* .infobot
*┊🛠️✎* .speed
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ɪɴғᴏʀᴍᴀᴄɪᴏɴ\`* 🍊 ᦡᦡ
*┊🍊✎* .creador
*┊🍊✎* .owner
*┊🍊✎* .dash
*┊🍊✎* .dashboard
*┊🍊✎* .views
*┊🍊✎* .database
*┊🍊✎* .usuarios
*┊🍊✎* .user
*┊🍊✎* .ds
*┊🍊✎* .fixmsgespera
*┊🍊✎* .infobot
*┊🍊✎* .speed
*┊🍊✎* .ping
*┊🍊✎* .sistema
*┊🍊✎* .speed
*┊🍊✎* .speedtest
*┊🍊✎* .groups
*┊🍊✎* .grouplist
*┊🍊✎* .reportar
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ɴsғᴡ\`* 🔞 ᦡᦡ
*┊🔞✎* .nsfwloli
*┊🔞✎* .nsfwfoot
*┊🔞✎* .nsfwass
*┊🔞✎* .nsfwbdsm
*┊🔞✎* .nsfwcum
*┊🔞✎* .nsfwero
*┊🔞✎* .nsfwfemdom
*┊🔞✎* .nsfwfoot
*┊🔞✎* .nsfwglass
*┊🔞✎* .nsfworgy
*┊🔞✎* .yuri
*┊🔞✎* .yuri2
*┊🔞✎* .yaoi
*┊🔞✎* .yaoi2
*┊🔞✎* .panties
*┊🔞✎* .tetas
*┊🔞✎* .booty
*┊🔞✎* .ecchi
*┊🔞✎* .furro
*┊🔞✎* .hentai
*┊🔞✎* .trapito
*┊🔞✎* .imagenlesbians
*┊🔞✎* .pene
*┊🔞✎* .porno
*┊🔞✎* .randomxxx
*┊🔞✎* .pechos
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ᴄʀᴇᴀᴅᴏʀ\`* 🥥 ᦡᦡ
*┊🥥✎* .enable <option>
*┊🥥✎* .disable <option>
*┊🥥✎* .addprem [@user] <days>
*┊🥥✎* >
*┊🥥✎* =>
*┊🥥✎* .copia
*┊🥥✎* .broadcastgroup <teks>
*┊🥥✎* .bcgc <teks>
*┊🥥✎* .bcgc2
*┊🥥✎* .broadcast <teks>
*┊🥥✎* .bc <teks>
*┊🥥✎* .cheat
*┊🥥✎* .cleartmp
*┊🥥✎* .delprem <@user>
*┊🥥✎* .dsowner
*┊🥥✎* $
*┊🥥✎* .fetch
*┊🥥✎* .get
*┊🥥✎* .getplugin *<nombre>*
*┊🥥✎* .nuevabiobot <teks>
*┊🥥✎* .nuevafotobot *<imagen>*
*┊🥥✎* .nuevonombrebot <teks>
*┊🥥✎* .prefix [prefix]
*┊🥥✎* .resetprefix
*┊🥥✎* .restart
*┊🥥✎* .saveplugin nombre
*┊🥥✎* .update
*┊🥥✎* .actualizar
*┊🥥✎* >
*┊🥥✎* =>
*┊🥥✎* .resetpersonajes
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`sᴛᴀғғ\`* 🥤 ᦡᦡ
*┊🥤✎*︎ .autoadmin
*┊🥤✎* .banchat
*┊🥤✎* .banuser <@tag> <razón>
*┊🥤✎* .grupocrear <nombre>
*┊🥤✎* .ip <alamat ip>
*┊🥤✎* .join <link>
*┊🥤✎* .unbanchat
*┊🥤✎* .unbanuser <@tag>
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ᴀᴜᴅɪᴏs\`* 🐉 ᦡᦡ
*┊🐉✎* .bass [vn]
*┊🐉✎* .blown [vn]
*┊🐉✎* .deep [vn]
*┊🐉✎* .earrape [vn]
*┊🐉✎* .fast [vn]
*┊🐉✎* .fat [vn]
*┊🐉✎* .nightcore [vn]
*┊🐉✎* .reverse [vn]
*┊🐉✎* .robot [vn]
*┊🐉✎* .slow [vn]
*┊🐉✎* .smooth [vn]
*┊🐉✎* .tupai [vn]
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ɪᴀ-ɪᴀ\`* 🐚 ᦡᦡ
*┊🐚✎* .bard
*┊🐚✎* .chatgpt <texto>
*┊🐚✎* .ia <texto>
*┊🐚✎* .dalle
*┊🐚✎* .remini
*┊🐚✎* .llama
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*

𓂂𓏸  𐅹੭੭   *\`ᴄᴏɴᴠᴇʀᴛɪᴅᴏʀᴇs\`* 🤍 ᦡᦡ
*┊🤍✎* .togifaud
*┊🤍✎* .tourl
*┊🤍✎* .tovideo
*╰─ׅ─๋︩︪─𖥸⊰‿⃝𝆬✿⃮⃝𝆬‿۪۪⊱𖥸ׅ─ׅ─๋︩︪─❁ཻུ۪۪♡*


> ${dev}`.trim()

await conn.sendMessage(m.chat, { video: { url: vid.getRandom() }, caption: menu, contextInfo: { mentionedJid: [m.sender], isForwarded: true, forwardedNewsletterMessageInfo: { newsletterJid: channelRD.id, newsletterName: channelRD.name, serverMessageId: -1, }, forwardingScore: 999, externalAdReply: { title: '⏤͟͞ू⃪ ፝͜⁞M͢ᴇɢ፝֟ᴜᴍ⃨ɪɴ⃜✰⃔࿐', body: dev, thumbnailUrl: perfil, sourceUrl: redes, mediaType: 1, renderLargerThumbnail: false,
}, }, gifPlayback: true, gifAttribution: 0 }, { quoted: null })
await m.react(emojis)    

} catch (e) {
await m.reply(`✘ Ocurrió un error al enviar el menú\n\n${e}`)
await m.react(error)
}}

handler.help = ['menu']
handler.tags = ['main']
handler.command = ['menu', 'help', 'menú', 'allmenú', 'allmenu', 'menucompleto'] 
handler.register = true
export default handler

const more = String.fromCharCode(8206)
const readMore = more.repeat(4001)
function clockString(ms) {
let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')}
